Tekla Open API Reference for Tekla Structures 2025
PreferredSymbolPlacingTypes.PointPlacingType Method
 The object is placed at one point (the insertion point) without any additional placing options.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static PreferredPlacingTypeBase PointPlacingType()
Public Shared Function PointPlacingType As PreferredPlacingTypeBase
Return Value
Type: PreferredPlacingTypeBase
A new point placing type instance.
See Also
Reference
PreferredSymbolPlacingTypes Class
Tekla.Structures.Drawing Namespace